---
kind: method
id: M:Autodesk.Revit.DB.EdgeEndPoint.Dispose
source: html/da5bff3f-8e6e-dcfa-a7cf-2bcf89bd4574.htm
---
# Autodesk.Revit.DB.EdgeEndPoint.Dispose Method

Releases all resources used by the EdgeEndPoint

## Syntax (C#)
```csharp
public void Dispose()
```